Hi, this problem is bugging me also. I hope the check to create or update is coming soon. 

This is my Terraform plan (it is redacted to not include personal data):

```
Terraform will perform the following actions:
  # module.network.google_compute_global_address.internal_ip_block["service-1"] will be created
  + resource "google_compute_global_address" "internal_ip_block" {
      + address            = (known after apply)
      + address_type       = "INTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "service-1-private-ip-block"
      + network            = "projects/REDACTED/global/networks/staging-version-2020-network"
      + prefix_length      = 16
      + project            = "REDACTED"
      + purpose            = "VPC_PEERING"
      + self_link          = (known after apply)
    }
  # module.network.google_service_networking_connection.private_vpc_connection[0] will be created
  + resource "google_service_networking_connection" "private_vpc_connection" {
      + id                      = (known after apply)
      + network                 = "projects/REDACTED/global/networks/staging-version-2020-network"
      + peering                 = (known after apply)
      + reserved_peering_ranges = [
          + "service-1-private-ip-block",
        ]
      + service                 = "servicenetworking.googleapis.com"
    }
Plan: 2 to add, 0 to change, 0 to destroy.
```

But I got this error all the time now:

```
╷
│ Error: Error waiting for Create Service Networking Connection: Error code 9, message: Cannot modify allocated ranges in CreateConnection. Please use UpdateConnection.
│ Help Token: AWUw39Xxnx9W0-wEB9pxcgch0yLzPZiSo6AeSxwAyEFhd_5PFO5yY80GS9R0f8zF1Lsvc-u6yeIQLhaK7-G-ZWfq9APaxjh4s0abPclWI5Op-Yfe
│ 
│   with module.network.google_service_networking_connection.private_vpc_connection[0],
│   on .terraform/modules/network/main.tf line 87, in resource "google_service_networking_connection" "private_vpc_connection":
│   87: resource "google_service_networking_connection" "private_vpc_connection" {
```

I do not understand exactly what is going wrong, because I thought the private Service Networking Connection is not yet existing in the project. So how can it complain about not been able to create?

There are no Service network connection's if I look in the console:

![image](https://github.com/hashicorp/terraform-provider-google/assets/1582541/0fc2a555-8b8a-4eba-990d-351271e7caef)

And I am able to create the one I want Terraform to make, see:

![image](https://github.com/hashicorp/terraform-provider-google/assets/1582541/b55567a2-6351-4d9e-b9fc-2acc7c74b496)

Am I missing something, or do I misunderstand something? I would really like to know, thank you.
